//IMXEC_H323.h
#ifndef __IMXEC_H323_H__
#define __IMXEC_H323_H__

#include <IMXEC/IMXEC_Export.h>
#include <IMXEC/IMXEC_VideoSetting.h>
#include <IMXEC/IMXEC_AudioSetting.h>

//H323协议
class IMXEC_API IMXEC_H323
{
public:
	IMXEC_H323(void);
	virtual~IMXEC_H323(void);
public:
	//注册状态
	typedef enum
	{
		REG_IDLE=0,				//没有注册
		REG_OK,					//注册成功
		REG_ERR_ID,				//注册失败，帐号错误
		REG_ERR_PASSWORD,		//注册失败，密码错误
		REG_ERR_UNKOWN_HOST		//注册失败，无法连接服务器
	}REG_STATE;


public:
	/******************************************************************************
	* SetH323ID
	*描述：设置注册帐号
	*输入：	cszH323ID		-注册帐号
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetH323ID(const char*cszH323ID);

	/******************************************************************************
	* SetTelNumber
	*描述：设置电话号码
	*输入：	cszTelNumber		-电话号码
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetTelNumber(const char*cszTelNumber);

	/******************************************************************************
	* SetRegPassword
	*描述：设置注册密码
	*输入：	cszRegPassword	-注册帐号
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetRegPassword(const char*cszRegPassword);

	/******************************************************************************
	* SetUserName
	*描述：设置用户名称
	*输入：	cszUserName		-用户名称
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetUserName(const char*cszUserName);

	/******************************************************************************
	* SetRegHost
	*描述：设置用户名称
	*输入：	cszHost			-注册服务器
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetRegHost(const char*cszHost);

	/******************************************************************************
	* Register
	*描述：注册
	*输入：nType			-注册类型【0:自动查找GK服务器，非0:注册到指定的GK服务器】
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int Register(int nType=1);

	/******************************************************************************
	* UnRegister
	*描述：注销
	*输入：无
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int UnRegister(void);

	/******************************************************************************
	* GetRegState
	*描述：获取注册状态
	*输入：无
	*输出：	nRegState			-注册状态
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int GetRegState(REG_STATE&nRegState);

	/******************************************************************************
	* SetH323ListenPort
	*描述：设置侦听端口
	*输入：	nH323ListenPort			-侦听端口
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetH323ListenPort(unsigned short nH323ListenPort);

	/******************************************************************************
	* SetLocalIP
	*描述：设置注册帐号
	*输入：	cszH323ID		-注册帐号
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetLocalIP(const char*cszLocalIP);

	/******************************************************************************
	* SetRTPBasePort
	*描述：设置侦听端口
	*输入：	nRTPBasePort			-RTP开始端口
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetRTPBasePort(unsigned short nRTPBasePort);

	/******************************************************************************
	* SetSupportH239
	*描述：设置是否支持H239
	*输入：nFlag		-是否支持H239
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetSupportH239(int nSupportH239);

	/******************************************************************************
	* SetAudioDevParam
	*描述：设置主流视频设备参数
	*输入： nAudioCodecID		-音频编码
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetAudioDevParam(X_AUDIO_CODEC_ID nAudioCodecID);

	/******************************************************************************
	* SetMainVideoDevParam
	*描述：设置主流视频设备参数
	*输入： nDevID				-设备标识
			nFrameRate			-帧率
			nBitrate			-码流
			nVideoCodecType		-视频编码
			nVideoFormatType	-视频格式
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetMainVideoDevParam(int nDevID,int nFrameRate,int nBitrate,VIDEC_CODEC_TYPE nVideoCodecType,VIDEO_FORMAT_TYPE nVideoFormatType);

	/******************************************************************************
	* SetSecondVideoDevParam
	*描述：设置辅流视频设备参数
	*输入： nDevID				-设备标识
			nFrameRate			-帧率
			nBitrate			-码流
			nVideoCodecType		-视频编码
			nVideoFormatType	-视频格式
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int SetSecondVideoDevParam(int nDevID,int nFrameRate,int nBitrate,VIDEC_CODEC_TYPE nVideoCodecType,VIDEO_FORMAT_TYPE nVideoFormatType);

	/******************************************************************************
	* Start
	*描述：启动H323服务
	*输入：无
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int Start(void);

	/******************************************************************************
	* Stop
	*描述：停止H323服务
	*输入：无
	*输出：无
	*返回值：成功返回0，失败返回-1
	*****************************************************************************/
	static int Stop(void);
};




#endif
